IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/PRU_ICSSG1_IEP1.xml
<module name="PRU_ICSSG1_IEP1" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="PR1_IEP1__SLV__REGS_global_cfg_reg" acronym="PR1_IEP1__SLV__REGS_global_cfg_reg" offset="0x0" width="32" description="">
		<bitfield id="CMP_INC" width="12" begin="19" end="8" resetval="0x5" description="" range="19 - 8" rwaccess="R/W"/> 
		<bitfield id="DEFAULT_INC" width="4" begin="7" end="4" resetval="0x5" description="" range="7 - 4" rwaccess="R/W"/> 
		<bitfield id="CNT_ENABLE" width="1" begin="0" end="0" resetval="0x0" description="" range="0" rwaccess="R/W"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_global_status_reg" acronym="PR1_IEP1__SLV__REGS_global_status_reg" offset="0x4" width="32" description="">
		<bitfield id="CNT_OVF" width="1" begin="0" end="0" resetval="0x0" description="" range="0" rwaccess="R/W1TC"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_compen_reg" acronym="PR1_IEP1__SLV__REGS_compen_reg" offset="0x8" width="32" description="">
		<bitfield id="COMPEN_CNT" width="23" begin="22" end="0" resetval="0x0" description="" range="22 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_slow_compen_reg" acronym="PR1_IEP1__SLV__REGS_slow_compen_reg" offset="0xC" width="32" description="">
		<bitfield id="SLOW_COMPEN_CNT" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_count_reg0" acronym="PR1_IEP1__SLV__REGS_count_reg0" offset="0x10" width="32" description="">
		<bitfield id="COUNT_LO" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_count_reg1" acronym="PR1_IEP1__SLV__REGS_count_reg1" offset="0x14" width="32" description="">
		<bitfield id="COUNT_HI" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_cap_cfg_reg" acronym="PR1_IEP1__SLV__REGS_cap_cfg_reg" offset="0x18" width="32" description="">
		<bitfield id="EXT_CAP_EN" width="6" begin="23" end="18" resetval="0x0" description="" range="23 - 18" rwaccess="R/W"/> 
		<bitfield id="CAP_ASYNC_EN" width="8" begin="17" end="10" resetval="0x127" description="" range="17 - 10" rwaccess="R/W"/> 
		<bitfield id="CAP_EN" width="10" begin="9" end="0" resetval="0x0" description="" range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_cap_status_reg" acronym="PR1_IEP1__SLV__REGS_cap_status_reg" offset="0x1C" width="32" description="">
		<bitfield id="CAP_RAW" width="8" begin="23" end="16" resetval="0x0" description="" range="23 - 16" rwaccess="R"/> 
		<bitfield id="CAP_VALID" width="11" begin="10" end="0" resetval="0x0" description="" range="10 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_capr0_reg0" acronym="PR1_IEP1__SLV__REGS_capr0_reg0" offset="0x20" width="32" description="">
		<bitfield id="CAPR0_0" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_capr0_reg1" acronym="PR1_IEP1__SLV__REGS_capr0_reg1" offset="0x24" width="32" description="">
		<bitfield id="CAPR0_1" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_capr1_reg0" acronym="PR1_IEP1__SLV__REGS_capr1_reg0" offset="0x28" width="32" description="">
		<bitfield id="CAPR1_0" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_capr1_reg1" acronym="PR1_IEP1__SLV__REGS_capr1_reg1" offset="0x2C" width="32" description="">
		<bitfield id="CAPR1_1" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_capr2_reg0" acronym="PR1_IEP1__SLV__REGS_capr2_reg0" offset="0x30" width="32" description="">
		<bitfield id="CAPR2_0" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_capr2_reg1" acronym="PR1_IEP1__SLV__REGS_capr2_reg1" offset="0x34" width="32" description="">
		<bitfield id="CAPR2_1" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_capr3_reg0" acronym="PR1_IEP1__SLV__REGS_capr3_reg0" offset="0x38" width="32" description="">
		<bitfield id="CAPR3_0" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_capr3_reg1" acronym="PR1_IEP1__SLV__REGS_capr3_reg1" offset="0x3C" width="32" description="">
		<bitfield id="CAPR3_1" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_capr4_reg0" acronym="PR1_IEP1__SLV__REGS_capr4_reg0" offset="0x40" width="32" description="">
		<bitfield id="CAPR4_0" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_capr4_reg1" acronym="PR1_IEP1__SLV__REGS_capr4_reg1" offset="0x44" width="32" description="">
		<bitfield id="CAPR4_1" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_capr5_reg0" acronym="PR1_IEP1__SLV__REGS_capr5_reg0" offset="0x48" width="32" description="">
		<bitfield id="CAPR5_0" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_capr5_reg1" acronym="PR1_IEP1__SLV__REGS_capr5_reg1" offset="0x4C" width="32" description="">
		<bitfield id="CAPR5_1" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_capr6_reg0" acronym="PR1_IEP1__SLV__REGS_capr6_reg0" offset="0x50" width="32" description="">
		<bitfield id="CAPR6_0" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_capr6_reg1" acronym="PR1_IEP1__SLV__REGS_capr6_reg1" offset="0x54" width="32" description="">
		<bitfield id="CAPR6_1" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_capf6_reg0" acronym="PR1_IEP1__SLV__REGS_capf6_reg0" offset="0x58" width="32" description="">
		<bitfield id="CAPF6_0" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_capf6_reg1" acronym="PR1_IEP1__SLV__REGS_capf6_reg1" offset="0x5C" width="32" description="">
		<bitfield id="CAPF6_1" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R"/>
	</register>
