IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/PRU_ICSSG1_IEP1.xml
	<register id="PR1_IEP1__SLV__REGS_capr7_reg0" acronym="PR1_IEP1__SLV__REGS_capr7_reg0" offset="0x60" width="32" description="">
		<bitfield id="CAPR7_0" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_capr7_reg1" acronym="PR1_IEP1__SLV__REGS_capr7_reg1" offset="0x64" width="32" description="">
		<bitfield id="CAPR7_1" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_capf7_reg0" acronym="PR1_IEP1__SLV__REGS_capf7_reg0" offset="0x68" width="32" description="">
		<bitfield id="CAPF7_0" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_capf7_reg1" acronym="PR1_IEP1__SLV__REGS_capf7_reg1" offset="0x6C" width="32" description="">
		<bitfield id="CAPF7_1" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_cmp_cfg_reg" acronym="PR1_IEP1__SLV__REGS_cmp_cfg_reg" offset="0x70" width="32" description="">
		<bitfield id="SHADOW_EN" width="1" begin="17" end="17" resetval="0x0" description="" range="17" rwaccess="R/W"/> 
		<bitfield id="CMP_EN" width="16" begin="16" end="1" resetval="0x0" description="" range="16 - 1" rwaccess="R/W"/> 
		<bitfield id="CMP0_RST_CNT_EN" width="1" begin="0" end="0" resetval="0x0" description="" range="0" rwaccess="R/W"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_cmp_status_reg" acronym="PR1_IEP1__SLV__REGS_cmp_status_reg" offset="0x74" width="32" description="">
		<bitfield id="CMP_STATUS" width="16" begin="15" end="0" resetval="0x0" description="" range="15 - 0" rwaccess="R/W1TC"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_cmp0_reg0" acronym="PR1_IEP1__SLV__REGS_cmp0_reg0" offset="0x78" width="32" description="">
		<bitfield id="CMP0_0" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_cmp0_reg1" acronym="PR1_IEP1__SLV__REGS_cmp0_reg1" offset="0x7C" width="32" description="">
		<bitfield id="CMP0_1" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_cmp1_reg0" acronym="PR1_IEP1__SLV__REGS_cmp1_reg0" offset="0x80" width="32" description="">
		<bitfield id="CMP1_0" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_cmp1_reg1" acronym="PR1_IEP1__SLV__REGS_cmp1_reg1" offset="0x84" width="32" description="">
		<bitfield id="CMP1_1" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_cmp2_reg0" acronym="PR1_IEP1__SLV__REGS_cmp2_reg0" offset="0x88" width="32" description="">
		<bitfield id="CMP2_0" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_cmp2_reg1" acronym="PR1_IEP1__SLV__REGS_cmp2_reg1" offset="0x8C" width="32" description="">
		<bitfield id="CMP2_1" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_cmp3_reg0" acronym="PR1_IEP1__SLV__REGS_cmp3_reg0" offset="0x90" width="32" description="">
		<bitfield id="CMP3_0" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_cmp3_reg1" acronym="PR1_IEP1__SLV__REGS_cmp3_reg1" offset="0x94" width="32" description="">
		<bitfield id="CMP3_1" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_cmp4_reg0" acronym="PR1_IEP1__SLV__REGS_cmp4_reg0" offset="0x98" width="32" description="">
		<bitfield id="CMP4_0" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_cmp4_reg1" acronym="PR1_IEP1__SLV__REGS_cmp4_reg1" offset="0x9C" width="32" description="">
		<bitfield id="CMP4_1" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_cmp5_reg0" acronym="PR1_IEP1__SLV__REGS_cmp5_reg0" offset="0xA0" width="32" description="">
		<bitfield id="CMP5_0" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_cmp5_reg1" acronym="PR1_IEP1__SLV__REGS_cmp5_reg1" offset="0xA4" width="32" description="">
		<bitfield id="CMP5_1" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_cmp6_reg0" acronym="PR1_IEP1__SLV__REGS_cmp6_reg0" offset="0xA8" width="32" description="">
		<bitfield id="CMP6_0" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_cmp6_reg1" acronym="PR1_IEP1__SLV__REGS_cmp6_reg1" offset="0xAC" width="32" description="">
		<bitfield id="CMP6_1" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_cmp7_reg0" acronym="PR1_IEP1__SLV__REGS_cmp7_reg0" offset="0xB0" width="32" description="">
		<bitfield id="CMP7_0" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_cmp7_reg1" acronym="PR1_IEP1__SLV__REGS_cmp7_reg1" offset="0xB4" width="32" description="">
		<bitfield id="CMP7_1" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_rxipg0_reg" acronym="PR1_IEP1__SLV__REGS_rxipg0_reg" offset="0xB8" width="32" description="">
		<bitfield id="RX_MIN_IPG0" width="16" begin="31" end="16" resetval="0x65535" description="" range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="RX_IPG0" width="16" begin="15" end="0" resetval="0x0" description="" range="15 - 0" rwaccess="R"/>
	</register>
