IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/PRU_ICSSG1_IEP1.xml
	<register id="PR1_IEP1__SLV__REGS_sync0_period_reg" acronym="PR1_IEP1__SLV__REGS_sync0_period_reg" offset="0x194" width="32" description="">
		<bitfield id="SYNC0_PERIOD" width="32" begin="31" end="0" resetval="0x1" description="" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_sync1_delay_reg" acronym="PR1_IEP1__SLV__REGS_sync1_delay_reg" offset="0x198" width="32" description="">
		<bitfield id="SYNC1_DELAY" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_sync_start_reg" acronym="PR1_IEP1__SLV__REGS_sync_start_reg" offset="0x19C" width="32" description="">
		<bitfield id="SYNC_START" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_wd_prediv_reg" acronym="PR1_IEP1__SLV__REGS_wd_prediv_reg" offset="0x200" width="32" description="">
		<bitfield id="PRE_DIV" width="16" begin="15" end="0" resetval="0x20000" description="" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_pdi_wd_tim_reg" acronym="PR1_IEP1__SLV__REGS_pdi_wd_tim_reg" offset="0x204" width="32" description="">
		<bitfield id="PDI_WD_TIME" width="16" begin="15" end="0" resetval="0x1000" description="" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_pd_wd_tim_reg" acronym="PR1_IEP1__SLV__REGS_pd_wd_tim_reg" offset="0x208" width="32" description="">
		<bitfield id="PD_WD_TIME" width="16" begin="15" end="0" resetval="0x1000" description="" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_wd_status_reg" acronym="PR1_IEP1__SLV__REGS_wd_status_reg" offset="0x20C" width="32" description="">
		<bitfield id="PDI_WD_STAT" width="1" begin="16" end="16" resetval="0x1" description="" range="16" rwaccess="R"/> 
		<bitfield id="PD_WD_STAT" width="1" begin="0" end="0" resetval="0x1" description="" range="0" rwaccess="R"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_wd_exp_cnt_reg" acronym="PR1_IEP1__SLV__REGS_wd_exp_cnt_reg" offset="0x210" width="32" description="">
		<bitfield id="PD_EXP_CNT" width="8" begin="15" end="8" resetval="0x0" description="" range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="PDI_EXP_CNT" width="8" begin="7" end="0" resetval="0x0" description="" range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_wd_ctrl_reg" acronym="PR1_IEP1__SLV__REGS_wd_ctrl_reg" offset="0x214" width="32" description="">
		<bitfield id="PDI_WD_EN" width="1" begin="16" end="16" resetval="0x0" description="" range="16" rwaccess="R/W"/> 
		<bitfield id="PD_WD_EN" width="1" begin="0" end="0" resetval="0x0" description="" range="0" rwaccess="R/W"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_digio_ctrl_reg" acronym="PR1_IEP1__SLV__REGS_digio_ctrl_reg" offset="0x300" width="32" description="">
		<bitfield id="OUT_MODE" width="2" begin="7" end="6" resetval="0x0" description="" range="7 - 6" rwaccess="R/W"/> 
		<bitfield id="IN_MODE" width="2" begin="5" end="4" resetval="0x0" description="" range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="WD_MODE" width="1" begin="3" end="3" resetval="0x0" description="" range="3" rwaccess="R/W"/> 
		<bitfield id="BIDI_MODE" width="1" begin="2" end="2" resetval="0x1" description="" range="2" rwaccess="R"/> 
		<bitfield id="OUTVALID_MODE" width="1" begin="1" end="1" resetval="0x0" description="" range="1" rwaccess="R/W"/> 
		<bitfield id="OUTVALID_POL" width="1" begin="0" end="0" resetval="0x0" description="" range="0" rwaccess="R"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_digio_status_reg" acronym="PR1_IEP1__SLV__REGS_digio_status_reg" offset="0x304" width="32" description="">
		<bitfield id="DIGIO_STAT" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_digio_data_in_reg" acronym="PR1_IEP1__SLV__REGS_digio_data_in_reg" offset="0x308" width="32" description="">
		<bitfield id="DATA_IN" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_digio_data_in_raw_reg" acronym="PR1_IEP1__SLV__REGS_digio_data_in_raw_reg" offset="0x30C" width="32" description="">
		<bitfield id="DATA_IN_RAW" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_digio_data_out_reg" acronym="PR1_IEP1__SLV__REGS_digio_data_out_reg" offset="0x310" width="32" description="">
		<bitfield id="DATA_OUT" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_digio_data_out_en_reg" acronym="PR1_IEP1__SLV__REGS_digio_data_out_en_reg" offset="0x314" width="32" description="">
		<bitfield id="DATA_OUT_EN" width="32" begin="31" end="0" resetval="0x0" description="" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_IEP1__SLV__REGS_digio_exp_reg" acronym="PR1_IEP1__SLV__REGS_digio_exp_reg" offset="0x318" width="32" description="">
		<bitfield id="EOF_SEL" width="1" begin="13" end="13" resetval="0x0" description="" range="13" rwaccess="R/W"/> 
		<bitfield id="SOF_SEL" width="1" begin="12" end="12" resetval="0x0" description="" range="12" rwaccess="R/W"/> 
		<bitfield id="SOF_DLY" width="4" begin="11" end="8" resetval="0x0" description="" range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="OUTVALID_DLY" width="4" begin="7" end="4" resetval="0x2" description="" range="7 - 4" rwaccess="R/W"/> 
		<bitfield id="SW_OUTVALID" width="1" begin="2" end="2" resetval="0x0" description="" range="2" rwaccess="R/W"/> 
		<bitfield id="OUTVALID_OVR_EN" width="1" begin="1" end="1" resetval="0x0" description="" range="1" rwaccess="R/W"/> 
		<bitfield id="SW_DATA_OUT_UP" width="1" begin="0" end="0" resetval="0x0" description="" range="0" rwaccess="R/W"/>
	</register>
</module>